/*
1. Константные O(1)
2. Логарифмические O(log2(n))
3. Линейные O(n)
4. Линейно-логарифмические O(log2(n) * n)
5. Квадратичные O(n ^ 2)
6. Кубические O(n ^ 3)
7. Задача о комивояжере(N!)

Лекции по С#(Последовательность Фиббоначчи) O(2^n)
*/

// Console.Clear();
// Console.Write("Введите число: ");
// int n = int.Parse(Console.ReadLine()!), result = 0;
// for (int i = 1; i <= n; i++)
// {
//     result += i;
// }
// Console.WriteLine($"Сумма чисел от 1 до {n} = {result} ");

